Revit 2027 API
PostPattern.CornerPostCondition Property
 The condition which controls the insertion of corner posts.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public BreakCornerCondition CornerPostCondition { get; set; }
Public Property CornerPostCondition As BreakCornerCondition
	Get
	Set
public:
property BreakCornerCondition CornerPostCondition {
	BreakCornerCondition get ();
	void set (BreakCornerCondition value);
}
member CornerPostCondition : BreakCornerCondition with get, set
Property Value
BreakCornerCondition
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
PostPattern Class
Autodesk.Revit.DB.Architecture Namespace